app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title ASC
---
  def index

    if params[:sort_param].nil? && params[:ratings].nil? && (!session[:sort_param].nil? || !session[:ratings].nil?)
      redirect_to movies_path(:sort_param => session[:sort_param], :ratings => session[:ratings])
    end

    @all_ratings = Movie.all_ratings
    @sort = params[:sort_param]
    @ratings = params[:ratings]

    if @ratings.nil?
      @ratings = Hash[@all_ratings.map {|rating| [rating, 1]}]